In [ ]:
"""                             [ASSIGNMENT]
Q1. List any five functions of the pandas library with execution.
ANSWER]                     memory_usage()
memory_usage() returns a Pandas Series having the memory usage of each column (in bytes) in a Pandas DataFrame. 
data_1.memory_usage(deep=True)

                             astype()
astype() is used to cast a Python object to a particular data type. It can be a very helpful function in case your data is not
stored in the correct format (data type) 
data_1['Gender'] = data_1.Gender.astype('category')

                              loc[:]
loc[:] helps to access a group of rows and columns in a dataset, a slice of the dataset, as per our requirement. 
data_1.loc[0:4, ['Name', 'Age', 'State']]

                              to_datetime()
to_datetime() converts a Python object to datetime format. It can take an integer, floating point number, list, Pandas Series,
or Pandas DataFrame as argument. to_datetime() is very powerful when the dataset has time series values or dates.

data_1['DOB'] = pd.to_datetime(data_1['DOB'])

                                value_counts()
value_counts() returns a Pandas Series containing the counts of unique values. 
data_1['State'].value_counts()    

                                   groupby()
groupby() is used to group a Pandas DataFrame by 1 or more columns, and perform some mathematical operation on it. groupby()
can be used to summarize data in a simple manner.

data_1.groupby(by='State').Salary.mean()

In [ ]:
"""
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.5)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.4)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
 df = pd.DataFrame(  {"A" : ["Alice", "Bob", "Claire"],
     " B"  : [25, 30,27],
     " C" : [ "Female", "Male" , "Female"]})

In [6]:
df

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [7]:
df.reindex([1,3,5])

     A     B     C
1  Bob  30.0  Male
3  NaN   NaN   NaN
5  NaN   NaN   NaN

In [ ]:
"""
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [13]:
df = pd.DataFrame({"VALUES" : [20,30,40,50,60,70]})

In [14]:
df

   VALUES
0      20
1      30
2      40
3      50
4      60
5      70

In [16]:
g = df.head(3)

In [17]:
g.sum()

VALUES    90
dtype: int64

In [ ]:
"""
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [19]:
 df = pd.DataFrame({"Text" : ["my name is shubham mishra"]})

In [20]:
df

                        Text
0  my name is shubham mishra

In [22]:
df["Word_COunt"] = df["Text"].apply(lambda x:len( x.split()))

In [23]:
df

                        Text  Word_COunt
0  my name is shubham mishra           5

In [ ]:
"""
Q5. How are DataFrame.size() and DataFrame.shape() different?

ANSWER]               DataFrame.size() 
Return an int representing the number of elements in this object.

Return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.
                      DataFrame.shape()
Return an int representing the number of elements in this object.

Return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.

In [ ]:
"""
Q6. Which function of pandas do we use to read an excel file?

ANSWER]Pandas read_excel() function is used for reading the excel files. Files can be imported using a URL link or can 
be directly imported from the disk.

In [ ]:
"""
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username' 
column.

In [84]:
df = pd.DataFrame({"Email" : ["shubham@domain.com","mishra@domain.com","ram@domain.com","krishna@domain.com"]})

In [85]:
df

                Email
0  shubham@domain.com
1   mishra@domain.com
2      ram@domain.com
3  krishna@domain.com

In [88]:
df["username"] = df["Email"].str.extract("(.*)@")

In [89]:
df

                Email username
0  shubham@domain.com  shubham
1   mishra@domain.com   mishra
2      ram@domain.com      ram
3  krishna@domain.com  krishna

In [ ]:
"""
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [58]:
df = pd.DataFrame({"A" : [3,8,6,2,9],
              "B" : [ 5,2,9,3,1],
              "C" : [ 1,7,4,5,2]})

In [59]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [61]:
df[1:2]

   A  B  C
1  8  2  7

In [62]:
df[4:5]

   A  B  C
4  9  1  2

In [ ]:
"""
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [25]:
df =pd.DataFrame({"values" : [ 23,45,67,78 ,76,90]})

In [26]:
df

   values
0      23
1      45
2      67
3      78
4      76
5      90

In [27]:
df.mean()

values    63.166667
dtype: float64

In [28]:
df.median()

values    71.5
dtype: float64

In [29]:
df.std()

values    24.750084
dtype: float64

In [ ]:
"""
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [52]:
df  = pd.DataFrame({"Sales" : [11,22,33,44,55,66,77,88,99,90,80,70],
              "Date" :  ["22jan","23jan","24jan","25jan","26jan","27jan","28jan","29jan","30jan","31jan","1feb","2feb"]})

In [53]:
df

    Sales   Date
0      11  22jan
1      22  23jan
2      33  24jan
3      44  25jan
4      55  26jan
5      66  27jan
6      77  28jan
7      88  29jan
8      99  30jan
9      90  31jan
10     80   1feb
11     70   2feb

In [54]:
df["moving average"] = df["Sales"].rolling(window=7).mean()

In [55]:
df

    Sales   Date  moving average
0      11  22jan             NaN
1      22  23jan             NaN
2      33  24jan             NaN
3      44  25jan             NaN
4      55  26jan             NaN
5      66  27jan             NaN
6      77  28jan       44.000000
7      88  29jan       55.000000
8      99  30jan       66.000000
9      90  31jan       74.142857
10     80   1feb       79.285714
11     70   2feb       81.428571

In [ ]:
"""
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
    Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

    Date     Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [35]:
df = pd.DataFrame({"Date" : ["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]})

In [36]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [37]:
df["Weekday"] = ["Sunday","Monday","Tuesday","Wednesday","Thursday"]

In [38]:
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [ ]:
"""
Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.
answer]

In [25]:
date = pd.date_range(start='2023-01-01' , end = '2023-02-3')

In [26]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31', '2023-02-01',
               '2023-02-02', '2023-02-03'],
              dtype='datetime64[ns]', freq='D')

In [27]:
df = pd.DataFrame({ "Date" :date})

In [31]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31
31 2023-02-01
32 2023-02-02
33 2023-02-03

In [34]:
df[df.apply(lambda x : x<= "2023-01-31")]

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31
31        NaT
32        NaT
33        NaT

In [ ]:
"""
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?
answer] pip install pandas 
        import pandas as pd 
Pandas is built on top of two core Python libraries—matplotlib for data visualization and NumPy for mathematical
operations. Pandas acts as a wrapper over these libraries, allowing you to access many of matplotlib's and NumPy's methods with less code.